Autodesk.Revit.DB.CurtainGrid.GetCell(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Get the specified cell located by the intersection of the grid lines.
uGridLineId:  The id of a grid line in the U-direction used to locate the cell.
vGridLineId:  The id of a grid line in the V-direction used to locate the cell.
Returns:  The cell.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the grid line ids are not part of this curtain grid.

Autodesk.Revit.DB.CurtainGrid.GetPanel(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Get the specified panel located by the intersection of the grid lines.
uGridLineId:  The id of a grid line in the U-direction used to locate the panel.
vGridLineId:  The id of a grid line in the V-direction used to locate the panel.
Returns:  The panel, or null if the panel cannot be found at this intersection.

Autodesk.Revit.DB.CurtainGrid.AddGridLine(System.Boolean,Autodesk.Revit.DB.XYZ,System.Boolean)
Add a grid line to the curtain grid.
isUGridLine:  If true, a U-direction grid line will be added. Otherwise, a V-direction grid line will be added.
position:  The position of the grid line.
oneSegmentOnly:  If it is true, only one segment is added. Otherwise, all segments will be added for the grid line.
Returns:  The created grid line is returned if the operation is successful. Otherwise, null is returned.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown if the position for the grid line is out of range.

Autodesk.Revit.DB.CurtainGrid.ChangePanelType(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.ElementType)
Change the type of a curtain panel.
panel:  The panel to be changed, it can be a type of Autodesk.Revit.DB.Panel or Autodesk.Revit.DB.Wall.
newSymbol:  The new symbol, it may be of Autodesk.Revit.DB.PanelType or Autodesk.Revit.DB.WallType when the panel is hosted in a curtain wall.
The new symbol can only be of type Autodesk.Revit.DB.PanelType if the Panel is hosted in a curtain system.
Returns:  If operation succeeds, the modified panel element is returned.
Throws Autodesk.Revit.Exceptions.ArgumentException:  Thrown if the input symbol can't be used for the panel.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:  Thrown when the type change failed.

Autodesk.Revit.DB.CurtainGrid.GetCurtainCells
Gets the CurtainCells owned by this curtain grid.
Returns:  The CurtainCells owned by this curtain grid.

Autodesk.Revit.DB.CurtainGrid.GetVGridLineIds
Gets all ElementIds of grid lines in the V direction.
Returns: The V grid line ElementIds

Autodesk.Revit.DB.CurtainGrid.GetUGridLineIds
Gets all ElementIds of grid lines in the U direction.
Returns: The U grid line ElementIds

Autodesk.Revit.DB.CurtainGrid.GetUnlockedMullionIds
Gets all ElementIds of the unlocked mullions of the curtain grid.
Remarks:
ElementIds are of Autodesk.Revit.DB.Mullion Elements.
Returns: The unlocked mullion ElementIds

Autodesk.Revit.DB.CurtainGrid.GetMullionIds
Gets all ElementIds of the mullions of the curtain grid.
Remarks:
ElementIds are of Autodesk.Revit.DB.Mullion Elements.
Returns: The mullion ElementIds

Autodesk.Revit.DB.CurtainGrid.GetUnlockedPanelIds
Gets all ElementIds of the unlocked panels of the curtain grid.
Remarks:  For curtain walls, the ElementIds in this set are of either Autodesk.Revit.DB.Panel or Autodesk.Revit.DB.Wall Elements.
For curtain systems, ElementIds are of Autodesk.Revit.DB.Panel Elements.
Returns: The unlocked panel ElementIds

Autodesk.Revit.DB.CurtainGrid.GetPanelIds
Gets all ElementIds of the panels of the curtain grid.
Remarks:  For curtain walls, the ElementIds in this set are of either Autodesk.Revit.DB.Panel or Autodesk.Revit.DB.Wall Elements.
For curtain systems, ElementIds are of Autodesk.Revit.DB.Panel Elements.
Returns: The panel ElementIds

Autodesk.Revit.DB.CurtainGrid.NumPanels
The number of panels.

Autodesk.Revit.DB.CurtainGrid.NumVLines
Get the number of grid lines in the V direction.

Autodesk.Revit.DB.CurtainGrid.NumULines
Get the number of grid lines in the U direction.

Autodesk.Revit.DB.CurtainGrid.Grid2Offset
The offset for V grid line pattern of the curtain grid.

Autodesk.Revit.DB.CurtainGrid.Grid2Angle
The angle for V grid line pattern of the curtain grid.

Autodesk.Revit.DB.CurtainGrid.Grid2Justification
The justification for the V grid line pattern of the curtain grid.

Autodesk.Revit.DB.CurtainGrid.Grid1Offset
The offset for the U grid line pattern of the curtain grid.

Autodesk.Revit.DB.CurtainGrid.Grid1Angle
The angle for the U grid line pattern of the curtain grid.

Autodesk.Revit.DB.CurtainGrid.Grid1Justification
The justification for the U grid line pattern of the curtain grid.

Autodesk.Revit.DB.CurtainGrid
Represents a curtain grid element within Autodesk Revit.
Remarks: This element is obtained from a curtain wall, curtain system, or curtain roof.
A curtain wall has only one curtain grid, while a curtain system or curtain roof may have several curtain grids.